---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ModelHermiteSpline
source: html/a730fe03-a0c4-7cf6-6d67-c691bf9fc759.htm
---
# ModelHermiteSpline Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.